data = '[{ "id": "1", "moviename": "Toy Story 4", "movieimg": "img/toystory4.jpg", "moviedesc": "Woody has always been confident about his place in the world, and that his priority is taking care of his kid, whether that is Andy or Bonnie. So when a beloved new craft-project-turned-toy, Forky declares himself as trash and not a toy, Woody takes it upon himself to show Forky why he should embrace being a toy.","movielikes": "0"},{ "id": "2","moviename": "Avengers: Endgame","movieimg": "img/avengers.jpg","moviedesc": "The grave course of events set in motion by Thanos that wiped out half the universe and fractured the Avengers ranks compels the remaining Avengers to take one final stand in Marvel Studios grand conclusion to twenty-two films.","movielikes": "0"},{"id": "3","moviename": "Fighting With My Family","movieimg": "img/fightingfamily.jpg","moviedesc": "Born into a tight-knit wrestling family, Paige and her brother Zak are ecstatic when they get the once-in-a-lifetime opportunity to try out for WWE. But when only Paige earns a spot in the competitive training program, she must leave her family and face this new, cut-throat world alone.","movielikes": "0"},{"id": "4","moviename": "Spider-Man: Far From Home","movieimg": "img/spiderman.jpg","moviedesc": "Our friendly neighborhood Super Hero decides to join his best friends Ned, MJ, and the rest of the gang on a European vacation. However, Peters plan to leave super heroics behind for a few weeks are quickly scrapped when he begrudgingly agrees to help Nick Fury uncover the mystery of several elemental creature attacks.","movielikes": "0"},{"id": "5","moviename": "Once Upon a Time In Hollywood","movieimg": "img/onceupon.jpg","moviedesc": "The two lead characters are Rick Dalton, former star of a western TV series, and his longtime stunt double Cliff Booth. Both are struggling to make it in a Hollywood they do not recognize anymore. But Rick has a very famous next-door neighbor...Sharon Tate.","movielikes": "0"},{"id": "6","moviename": "Apollo 11 (2019)","movieimg": "img/apollo11.jpg","moviedesc": "Apollo 11 is a cinematic space event film fifty years in the making. Featuring never-before-seen large-format film footage of one of humanitys greatest accomplishments.","movielikes": "0"}]';